# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

x = int(input("загадайте 1-e число от 1 до 1000 ==> "))
y = int(input("загадайте 2-e число от 1 до 1000 ==> "))

s = x + y
p = x*y
print(f'сумма загаданных чисел = {s}, произведение загаданных чисел = {p}')
print()

for i in range(s):
  for j in range(p):
    if s == i + j and p == i * j:
     print(f"первое загаданное число = {i}, второе загаданное число =  {j}")
   
    

        

    
