# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. Пользователь в первой 
# строке вводит натуральное число N – количество элементов в массиве. В последующих  строках записаны N целых чисел Ai. Последняя
# строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     6
#     -> 5

print("введите количество чисел в списке")
n = int(input())
print(f"введите число 'X'")
x = int(input())  
print(f"число Х = {x}")
print()

list_1 = []
for i in range(1, n + 1):
  list_1.append(i)
print(f"{list_1}")
print()

found = list_1[0]
for i in list_1:
  if abs(i - x) < abs(found - x):
    found = i
  
print(f'ближайшее число к Х ==> {found}')




        
    

    
   






  





    



