# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались 
# за проезд и получали билет с номером. Счастливым билетом называют такой билет с 
# шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
#  программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no



num_tic = input('Введите 6-значный номер билета: ')
if len(num_tic) != 6:
    print(f'Вы ввели не 6-ти значное число => {num_tic}!!')
else:
    left = int(num_tic[0]) + int(num_tic[1]) + int(num_tic[2])
    right = int(num_tic[3]) + int(num_tic[4]) + int(num_tic[5])
    if left == right:
        print(f'{num_tic} это СЧАСТЛИВЫЙ номер!!!')
    else:
        print(f'{num_tic} НЕ счастливый номер')