# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. Пользователь в первой строке 
# вводит натуральное число N – количество элементов в массиве. В последующих  строках записаны N целых чисел Ai. Последняя строка
# содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     3
#     -> 1

print("введите количество чисел в списке")
n = int(input())
print(f"введите число 'X' от 0 до 10")
x = int(input())
if x < 0 or x > 10:
        print(False)
    
print(f"число Х = {x}")
count = 0
list_1 = []
for i in range(n):
    import random
    a = random.randint(0,11)
    if a == x:
        count += 1
    list_1.append(a)
print(f"{list_1}")
print()
print(f"число {x} встречается {count} раз")
print()

