# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

print("Введите число")
n = int(input())
a = n
summa = 0
while a > 0:
  x = a % 10
  summa = summa + x
  a = a // 10
else:
  print(f"сумма цифр [{n}] => {summa}")