# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты
# вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть


coins_num = int(input("введите количество монет на столе ==>  "))

import random
eagles = random.randint(0, coins_num)

print(f'монеток на орле = {eagles}')
tails = coins_num - eagles
print(f'монеток на решке = {tails}')
if eagles > tails: print(f"Минимально нужно перевернуть {tails} монет") 
else:print(f"Минимально нужно перевернуть {eagles} монет")




