# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить
# k долек, если разрешается сделать один разлом по прямой между дольками (то есть 
# разломить шоколадку на два прямоугольника).

# *Пример:*

# 3 2 4 -> yes
# 3 2 1 -> no
print("введите число долек по горизонтали")
n = int(input())
print("введите число долек по вертикали")
m = int(input())
print("введите на какое число долек нужно разделить?")
k = int(input())
if k < m*n and (k%m==0 or k%n==0):
    print(f'YES, шоколад делится на {k}')
else:
    print(f'NO, шоколад НЕ делится на {k} ')